IdeaRS.OpenModel.Geometry3D.Vector3D
Represents a vector in three-dimensional space.

IdeaRS.OpenModel.Geometry3D.Vector3D.X
Gets or sets the X-dirrection value

IdeaRS.OpenModel.Geometry3D.Vector3D.Y
Gets or sets the Y-dirrection value

IdeaRS.OpenModel.Geometry3D.Vector3D.Z
Gets or sets the Z-dirrection value